Terraform Plan:
```aws_iam_role_policy.ecs_execution_role_policy: Refreshing state... [id=ecs_execution_role:ecs_execution_role_policy]
aws_cloudwatch_log_group.ecs_log_group: Refreshing state... [id=/ecs/siem]
aws_ebs_volume.gp3_volume_grafana: Refreshing state... [id=vol-046731b68b9381cc7]
aws_iam_role.ecs_execution_role: Refreshing state... [id=ecs_execution_role]
aws_eip.nat_eip: Refreshing state... [id=eipalloc-013904bf197fc22ee]
aws_vpc.main: Refreshing state... [id=vpc-03e05ec4d7ef91467]
aws_ebs_volume.gp3_volume_prometheus: Refreshing state... [id=vol-099aaae27ba9c2e1d]
aws_subnet.private2: Refreshing state... [id=subnet-0c554a1b8323b1de4]
aws_subnet.public1: Refreshing state... [id=subnet-03d02c1913e5a7e17]
aws_subnet.public2: Refreshing state... [id=subnet-0aaf48c52ec90dd1a]
aws_security_group.all: Refreshing state... [id=sg-022d663f4177b31cd]
aws_internet_gateway.gw: Refreshing state... [id=igw-04d2dae30427425bb]
aws_subnet.private1: Refreshing state... [id=subnet-0a892d70c825f21bc]
aws_lb_target_group.grafana_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:targetgroup/grafana-tg/21e0efed84b17b1a]
aws_nat_gateway.nat: Refreshing state... [id=nat-087a3050e779ad781]
aws_route_table.private: Refreshing state... [id=rtb-0ac24f37859269d8f]
aws_lb.grafana_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:loadbalancer/app/grafana-alb/9da52d4f8839500b]
aws_route_table.public: Refreshing state... [id=rtb-07d5e5349f9e26179]
module.ec2_prometheus.aws_instance.this[0]: Refreshing state... [id=i-0e7de500b79a83df6]
module.ec2_grafana.aws_instance.this[0]: Refreshing state... [id=i-08bd6045feda93592]
aws_route_table_association.private1: Refreshing state... [id=rtbassoc-01b8de58aaedb4470]
aws_route_table_association.private2: Refreshing state... [id=rtbassoc-02605b946f56d70ea]
aws_route_table_association.public2: Refreshing state... [id=rtbassoc-090db73de77cde073]
aws_route_table_association.public1: Refreshing state... [id=rtbassoc-029d604ae22b397e3]
aws_lb_listener.grafana_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:listener/app/grafana-alb/9da52d4f8839500b/73d6036069ea6daa]
aws_volume_attachment.ebs_att_prometheus: Refreshing state... [id=vai-3835864464]
aws_volume_attachment.ebs_att_grafana: Refreshing state... [id=vai-465159468]
aws_lb_target_group_attachment.grafana_attachment: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:941133421128:targetgroup/grafana-tg/21e0efed84b17b1a-20240126003225435200000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_iam_instance_profile.ec2_instance_profile will be created
  + resource "aws_iam_instance_profile" "ec2_instance_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "ec2-instance-profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "ec2-instance-role-generic"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # aws_iam_role.ec2_instance_role will be created
  + resource "aws_iam_role" "ec2_instance_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ec2-instance-role-generic"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.ecs_execution_role will be destroyed
  # (because aws_iam_role.ecs_execution_role is not in configuration)
  - resource "aws_iam_role" "ecs_execution_role" {
      - arn                   = "arn:aws:iam::941133421128:role/ecs_execution_role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2024-01-23T12:25:13Z" -> null
      - force_detach_policies = false -> null
      - id                    = "ecs_execution_role" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "ecs_execution_role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROA5WH7MLJEEZ4PONDMS" -> null

      - inline_policy {
          - name   = "ecs_execution_role_policy" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "logs:CreateLogStream",
                              - "logs:CreateLogGroup",
                              - "logs:PutLogEvents",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:logs:us-east-1:941133421128:log-group:/ecs/siem:*"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # aws_iam_role_policy.ecs_execution_role_policy will be destroyed
  # (because aws_iam_role_policy.ecs_execution_role_policy is not in configuration)
  - resource "aws_iam_role_policy" "ecs_execution_role_policy" {
      - id     = "ecs_execution_role:ecs_execution_role_policy" -> null
      - name   = "ecs_execution_role_policy" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                          - "logs:PutLogEvents",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:us-east-1:941133421128:log-group:/ecs/siem:*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role   = "ecs_execution_role" -> null
    }

  # aws_iam_role_policy_attachment.cloudwatch_agent_server_policy will be created
  + resource "aws_iam_role_policy_attachment" "cloudwatch_agent_server_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/CloudWatchAgentServerPolicy"
      + role       = "ec2-instance-role-generic"
    }

  # aws_iam_role_policy_attachment.ssm_managed_instance_core will be created
  + resource "aws_iam_role_policy_attachment" "ssm_managed_instance_core" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "ec2-instance-role-generic"
    }

  # module.ec2_grafana.aws_instance.this[0] will be updated in-place
  ~ resource "aws_instance" "this" {
      + iam_instance_profile                 = "ec2-instance-profile"
        id                                   = "i-08bd6045feda93592"
        tags                                 = {
            "Environment" = "prod"
            "Name"        = "Grafana"
            "Terraform"   = "true"
        }
        # (30 unchanged attributes hidden)

        # (10 unchanged blocks hidden)
    }

  # module.ec2_prometheus.aws_instance.this[0] will be updated in-place
  ~ resource "aws_instance" "this" {
      + iam_instance_profile                 = "ec2-instance-profile"
        id                                   = "i-0e7de500b79a83df6"
        tags                                 = {
            "Environment" = "prod"
            "Name"        = "Prometheus"
            "Terraform"   = "true"
        }
        # (30 unchanged attributes hidden)

        # (10 unchanged blocks hidden)
    }

Plan: 4 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```